{
  "auth": {
    "signIn": "Вхід",
    "email": "Пошта:",
    "emailPlaceholder": "Вкажіть свій імейл",
    "password": "Пароль:",
    "confirmPassword": "Підтвердити пароль:",
    "goToSignUp": "Реєстрація",
    "goToSignIn": "Вхід",
    "signUp": "Реєстрація",
    "confirmPolicy": "Будь ласка ознайомтеся з політикою конфіденційності"
  },
  "language": {
    "en": "Англійська",
    "ua": "Українська"
  },
  "alert": {
    "defaultHeader": "Увага",
    "defaultSubHeader": "Важливе повідомлення",
    "passwordHasBeenUpdatedHeader": "Нове повідомлення",
    "passwordHasBeenUpdatedText": "Пароль було успішно змінено!"
  },
  "pages": {
    "createSpending": "Додати витрати",
    "listOfExpenses": "Список витрат",
    "menu": "Меню",
    "logOut": "Вийди розбійник",
    "selectLanguage": "Мова",
    "selectLanguagePlaceholder": "Обрати"
  },
  "general": {
    "actions": {
      "add": "Додати",
      "addAs": "Додати як",
      "edit": "Змінити",
      "delete": "Видалити",
      "deleteSelected": "Видалити обране",
      "cancel": "Відміна",
      "confirm": "Так",
      "set": "Встановити",
      "select": "Обрати",
      "save": "Зберегти",
      "back": "Назад",
      "yes": "Так",
      "no": "Ні",
      "agree": "Я згоден/згідна",
      "removeToBasket": "Прибрати в кошик",
      "selectedToBasket": "Обране в кошик",
      "agreeWithPolicyCheckBox": "Погоджуюсь з політикою конфіденційності"
    },
    "dates": {
      "today": "Сьогодні",
      "yesterday": "Вчора",
      "week": "Тиждень",
      "month": "Місяць",
      "year": "Рік"
    },
    "months": {
      "january": "Січень",
      "february": "Лютий",
      "march": "Березень",
      "april": "Квітень",
      "may": "Травень",
      "june": "Червень",
      "july": "Липень",
      "august": "Серпень",
      "september": "Вересень",
      "october": "Жовтень",
      "november": "Листопад",
      "december": "Грудень"
    },
    "messages": {
      "noData": "Дані відсутні",
      "areYouSure": "Ви впевнені?"
    }
  },
  "home": {
    "title": "Домашня",
    "amount": "Сума:",
    "category": "Категорія:",
    "description": "Опис:",
    "amountPlaceholder": "Введіть сумму",
    "categoryPlaceholder": "Натисніть щоб обрати",
    "descriptionPlaceholder": "Введіть опис витрати. Необовʼязково",
    "addSpending": "Додати витрату",
    "update": "Оновити список",
    "newTransactions": "Нові Транзакції",
    "mySpending": "Мої витрати"
  },
  "statistics": {
    "title": "Статистика",
    "currentMonth": "Поточний місяць",
    "selectPeriod": "Обрати період",
    "fromDate": "Від (рік-місяць):",
    "toDate": "До (рік-місяць):",
    "choosePlaceholder": "Натисніть для вибору...",
    "currentWeek": "Поточний тиждень"
  },
  "settings": {
    "title": "Налаштування",
    "categoryManagement": "Керування категоріями",
    "monoAccSettings": "Параметри Monobank акаунту",
    "privacyNotice": "Політика конфіденційності",
    "inputToken": "Введення токену...",
    "setAcc": "Встановити (змінити) акаунт",
    "changeAcc": "Змінити акаунт",
    "forgetAcc": "Видалити акаунт",
    "selectCards": "Обрати картки",
    "white": "Біла",
    "black": "Чорна",
    "eAid": "Є-Підтримка",
    "currency": "Валюта",
    "type": "Тип",
    "updateCardList": "Оновити доступні картки",
    "cardsForTracking": "Вибір карток для трекінгу:",
    "pas": "Пароль",
    "currentPass": "Поточний пароль",
    "changePass": "Змінити пароль",
    "enterPass": "Ввести пароль",
    "newPass": "Новий пароль",
    "repeatPass": "Повторити пароль",
    "email": "Пошта",
    "changeEmail": "Змінити пошту",
    "enterEmail": "Ввести пошту",
    "newEmail": "Нова пошта",
    "repeatEmail": "Повторити пошту",
    "supportService": "Служба підтримки",
    "accDeletion": "Видалити акаунт"
  },
  "editSpendingModal": {
    "titleEdit": "Редагувати",
    "titleAdd": "Додати",
    "amount": "Сума:",
    "description": "Опис:",
    "amountPlaceholder": "Введіть сумму",
    "descriptionPlaceholder": "Введіть опис витрати. Необовʼязково",
    "category": "Категорія:",
    "selectCategoryPlaceholder": "Обрати категорію"
  },
  "selectMonthYearModal": {
    "selectDate": "Вибір дати"
  },
  "categoryManagementModal": {
    "categoryManagement": "Керування категоріями",
    "addCategory": "Додати категорію"
  },
  "editCategoryModal": {
    "editCategory": "Встановлення категорії",
    "categoryName": "Назва категорії",
    "enterCategoryName": "Введіть назву категорії",
    "addingCategory": "Додавання категорії"
  },
  "spendingBasketModal": {
    "spendingBasket": "Кошик витрат",
    "cleanBasket": "Очистити кошик",
    "basketEmpty": "Кошик порожній..."
  },
  "privacyNoticeModal": {
    "title": "Політика конфіденційності",
    "intro": "Дата набрання чинності: 17 квітня 2023 року. \nВаша конфіденційність має важливе значення для нас. Політика Mr.Spending полягає в повазі до вашої приватності та виконанні всіх відповідних законів та регуляцій, що стосуються будь-якої особистої інформації, яку ми можемо зібрати про вас під час використання Mr.Spending. \nУ цьому Повідомленні про конфіденційність нижче, термін 'додаток' означає Mr-Spending",
    "informationWeCollect": {
      "title": "Інформація, яку ми збираємо.",
      "content": "Інформація, яку ми збираємо, включає як інформацію, яку ви надаєте нам свідомо та активно в процесі використання додатка, так і будь-яку інформацію, яку автоматично надсилають ваші пристрої під час доступу до нашого додатка."
    },
    "logData": {
      "title": "Дані журналу",
      "content": "Коли ви відвідуєте наш додаток, наші сервери можуть автоматично реєструвати стандартні дані, які надає ваш пристрій. Це може включати IP-адресу вашого пристрою, сторінки, які ви відвідуєте, дату та час вашого візиту, час, проведений на кожній сторінці, інші деталі вашого візиту та технічні деталі, які виникають разом із будь-якими помилками, які ви можете зустріти. Будь ласка, зверніть увагу, що хоча ця інформація може не бути особисто ідентифіковувальною сама по собі, її можна поєднати з іншими даними, щоб особисто ідентифікувати окремих осіб."
    },
    "personalInformation": {
      "title": "Особиста інформація",
      "content": "Ми можемо запитувати особисту інформацію, до якої може належати один або декілька з наступних елементів: електронна пошта, ім'я, токен облікового запису Monobank у разі, якщо ви хочете завантажити транзакції безпосередньо з банківського API в додаток"
    },
    "processing": {
      "title": "Законні підстави для обробки вашої особистої інформації",
      "content": "Ми збираємо та використовуємо вашу особисту інформацію тільки тоді, коли маємо законну підставу для цього. У таких випадках ми збираємо тільки ту особисту інформацію, яка є необхідною для надання наших послуг вам."
    },
    "collectionAndUse": {
      "title": "Збір та використання інформації",
      "content": "Ми можемо збирати, зберігати, використовувати та розкривати інформацію з метою досягнення наступних цілей, і персональна інформація не буде оброблятися подальшим чином, що несумісний з цими цілями: забезпечення можливості доступу та використання нашої програми, а також завантаження інформації про транзакції вашого рахунку в Monobank безпосередньо з API банку до програми."
    },
    "security": {
      "title": "Безпека ваших персональних даних",
      "content": "Коли ми збираємо та обробляємо персональну інформацію, і під час зберігання цієї інформації, ми будемо захищати її комерційно прийнятними засобами, щоб запобігти втраті, крадіжці, а також несанкціонованому доступу, розкриттю, копіюванню, використанню або зміні. Хоча ми зробимо все можливе, щоб захистити персональну інформацію, яку ви надаєте нам, ми радимо, що жоден метод електронної передачі або зберігання не є на 100% безпечним, і ніхто не може гарантувати абсолютну безпеку даних. Ми будемо дотримуватися законів, що застосовуються до нас, щодо будь-якої порушення даних. Ви несете відповідальність за вибір будь-якого пароля та його надійності, забезпечуючи безпеку вашої власної інформації в межах наших послуг."
    },
    "durationOfKeeping": {
      "title": "Як довго ми зберігаємо вашу персональну інформацію",
      "content": "Ми зберігаємо вашу особисту інформацію лише стільки, скільки потрібно. Цей період часу може залежати від того, для чого ми використовуємо вашу інформацію відповідно до цієї політики конфіденційності. Якщо ваша особиста інформація більше не потрібна, ми видалимо її або зробимо анонімною, видаливши всі деталі, що ідентифікують вас."
    },
    "disclosure": {
      "title": "Розкриття персональної інформації третім сторонам",
      "content": "Ми можемо розкривати персональну інформацію наступним третім сторонам: провайдерам ІТ-послуг, провайдерам зберігання даних, хостингу та серверів, рекламодавцям або платформам аналітики, нашим співробітникам. Серед третіх сторін, які ми в даний час використовуємо, є Firebase для аутентифікації, Vercel для нашого веб-хостингу та MongoDB для зберігання даних."
    },
    "international": {
      "title": "Міжнародні передачі персональної інформації",
      "content": "Персональну інформацію, яку ми збираємо, зберігається та/або обробляється в тих місцях, де ми або наші партнери, афілійовані компанії та постачальники третьої сторони мають відповідні заклади. Будь ласка, зверніть увагу, що місця, в яких ми зберігаємо, обробляємо або передаємо вашу персональну інформацію, можуть не мати тих самих законів про захист даних, що й країна, в якій ви спочатку надали цю інформацію. Якщо ми передаємо вашу персональну інформацію третім сторонам в інші країни: (i) ми будемо виконувати ті передачі відповідно до вимог чинного законодавства; (ii) ми будемо захищати передану персональну інформацію відповідно до цієї політики конфіденційності."
    },
    "yourRights": {
      "title": "Ваші права та контроль над вашою персональною інформацією",
      "content": "Ви завжди маєте право зберігати від нас свої персональні дані, з розумінням того, що це може вплинути на ваш досвід використання нашого веб-сайту. Ми не будемо дискримінувати вас за використання будь-яких ваших прав щодо персональної інформації. Якщо ви надаєте нам персональну інформацію, ви розумієте, що ми будемо збирати, зберігати, використовувати та розкривати її відповідно до цієї політики конфіденційності. Ви маєте право запитати деталей будь-якої персональної інформації, яку ми маємо про вас. Якщо ми отримали персональну інформацію про вас від третьої сторони, ми будемо захищати її відповідно до цієї політики конфіденційності. Якщо ви є третьою стороною, яка надає персональну інформацію про когось іншого, ви заявляєте та гарантуєте, що у вас є згода цієї особи на надання персональної інформації нам. Якщо ви раніше дали згоду на використання вашої персональної інформації для прямого маркетингу, ви можете змінити своє рішення в будь-який момент. Будь ласка, зверніть увагу, що ми можемо запросити від вас конкретну інформацію для того, щоб підтвердити вашу особу. Якщо ви вважаєте, що будь-яка інформація, яку ми маємо про вас, є неточною, застарілою, неповною, неактуальною або містить помилки, будь ласка, зв'яжіться з нами за деталями, наданими в цій політиці конфіденційності. Ми приймемо розумні кроки для виправлення будь-якої інформації, що виявиться неточною, неповною, містить помилки або застарілою. Якщо ви вважаєте, що ми порушили відповідне законодавство про захист даних і хочете подати скаргу, будь ласка, зв'яжіться з нами за нижчевказаними деталями та надайте нам повну інформацію про заявлене порушення. Ми оперативно розглянемо вашу скаргу та надамо відповідь в письмовій формі, викладаючи результати нашого розслідування та кроки, які ми зробимо для вирішення вашої скарги. Ви також маєте право звернутися до регулюючого органу або органу захисту даних у зв'язку з вашою скаргою."
    },
    "limits": {
      "title": "Обмеження нашої політики",
      "content": "Наш додаток може містити посилання на зовнішні сайти, які не є нашими. Будь ласка, зверніть увагу, що ми не маємо контролю над змістом та політикою цих сайтів і не можемо приймати відповідальність за їх практики з охорони приватності."
    },
    "changes": {
      "title": "Зміни до цієї політики",
      "content": "Mи можемо змінювати нашу політику конфіденційності на нашу розсуд, щоб відображати оновлення наших бізнес-процесів, поточні прийнятні практики, або зміни в законодавстві або регулюванні. Якщо ми вирішимо змінити цю політику конфіденційності, ми опублікуємо зміни тут за тим самим посиланням, за яким ви звертаєтеся до цієї політики конфіденційності. Якщо цього вимагає закон, ми отримаємо вашу згоду або надамо вам можливість відмовитися від будь-яких нових використань вашої особистої інформації."
    },
    "contact": {
      "title": "Контакти",
      "content": "З питань конфіденційності ви можете звернутися до нас за наступними контактами: kovalovy76@gmail.com"
    }
  }
}
