{
  "auth": {
    "signIn": "Вхід",
    "email": "Логін:",
    "emailPlaceholder": "Вкажіть свій імейл",
    "password": "Пароль:",
    "confirmPassword": "Підтвердити пароль:",
    "goToSignUp": "Реєстрація",
    "goToSignIn": "Вхід",
    "signUp": "Реєстрація",
    "confirmPolicy": "Будь ласка ознайомтеся з політикою конфіденційності"
  },
  "language": {
    "en": "Англійська",
    "ua": "Українська"
  },
  "alert": {
    "passwordHasBeenUpdatedHeader": "Нове повідомлення",
    "passwordHasBeenUpdatedText": "Пароль було успішно змінено!"
  },
  "pages": {
    "createSpending": "Додати витрати",
    "listOfExpenses": "Список витрат",
    "menu": "Меню",
    "logOut": "Вийди розбійник",
    "selectLanguage": "Мова",
    "selectLanguagePlaceholder": "Обрати"
  },
  "general": {
    "actions": {
      "add": "Додати",
      "addAs": "Додати як",
      "edit": "Змінити",
      "delete": "Видалити",
      "deleteSelected": "Видалити обране",
      "cancel": "Відміна",
      "confirm": "Так",
      "set": "Встановити",
      "select": "Обрати",
      "save": "Зберегти",
      "back": "Назад",
      "yes": "Так",
      "no": "Ні",
      "agree": "Я згоден/згідна",
      "removeToBasket": "Прибрати в кошик",
      "selectedToBasket": "Обране в кошик"
    },
    "dates": {
      "today": "Сьогодні",
      "yesterday": "Вчора",
      "week": "Тиждень",
      "month": "Місяць",
      "year": "Рік"
    },
    "months": {
      "january": "Січень",
      "february": "Лютий",
      "march": "Березень",
      "april": "Квітень",
      "may": "Травень",
      "june": "Червень",
      "july": "Липень",
      "august": "Серпень",
      "september": "Вересень",
      "october": "Жовтень",
      "november": "Листопад",
      "december": "Грудень"
    },
    "messages": {
      "noData": "Дані відсутні",
      "areYouSure": "Ви впевнені?"
    }
  },
  "home": {
    "title": "Домашня",
    "amount": "Сума:",
    "category": "Категорія:",
    "description": "Опис:",
    "amountPlaceholder": "Введіть сумму",
    "categoryPlaceholder": "Натисніть щоб обрати",
    "descriptionPlaceholder": "Введіть опис витрати. Необовʼязково",
    "addSpending": "Додати витрату",
    "update": "Оновити список",
    "newTransactions": "Нові Транзакції",
    "mySpending": "Мої витрати"
  },
  "statistics": {
    "title": "Статистика",
    "currentMonth": "Поточний місяць",
    "selectPeriod": "Обрати період",
    "fromDate": "Від (рік-місяць):",
    "toDate": "До (рік-місяць):",
    "choosePlaceholder": "Натисніть для вибору...",
    "currentWeek": "Поточний тиждень"
  },
  "settings": {
    "title": "Налаштування",
    "categoryManagement": "Керування категоріями",
    "monoAccSettings": "Параметри Monobank акаунту",
    "privacyNotice": "Політика конфіденційності",
    "inputToken": "Введення токену...",
    "setAcc": "Встановити (змінити) акаунт",
    "changeAcc": "Змінити акаунт",
    "forgetAcc": "Видалити акаунт",
    "selectCards": "Обрати картки",
    "white": "Біла",
    "black": "Чорна",
    "eAid": "Є-Підтримка",
    "currency": "Валюта",
    "type": "Тип",
    "updateCardList": "Оновити доступні картки",
    "cardsForTracking": "Вибір карток для трекінгу:",
    "pas": "Пароль",
    "currentPass": "Поточний пароль",
    "changePass": "Змінити пароль",
    "enterPass": "Ввести пароль",
    "newPass": "Новий пароль",
    "repeatPass": "Повторити пароль",
    "email": "Пошта",
    "changeEmail": "Змінити пошту",
    "enterEmail": "Ввести пошту",
    "newEmail": "Нова пошта",
    "repeatEmail": "Повторити пошту"
  },
  "editSpendingModal": {
    "title": "Редагувати",
    "amount": "Сума:",
    "description": "Опис:",
    "amountPlaceholder": "Введіть сумму",
    "descriptionPlaceholder": "Введіть опис витрати. Необовʼязково",
    "category": "Категорія:",
    "selectCategoryPlaceholder": "Обрати категорію"
  },
  "selectMonthYearModal": {
    "selectDate": "Вибір дати"
  },
  "categoryManagementModal": {
    "categoryManagement": "Керування категоріями",
    "addCategory": "Додати категорію"
  },
  "editCategoryModal": {
    "editCategory": "Встановлення категорії",
    "categoryName": "Назва категорії",
    "enterCategoryName": "Введіть назву категорії"
  },
  "spendingBasketModal": {
    "spendingBasket": "Кошик витрат",
    "cleanBasket": "Очистити кошик",
    "basketEmpty": "Кошик порожній..."
  },
  "privacyNoticeModal": {
    "title": "Політика конфіденційності",
    "intro": "Вступає в дію: 17 квітня 2023. \nДотримання Політика конфіденційності є для нас дуже важливим. Mr.Spending поважає Вашу приватність і дотримується чинного закондавства стосовно будь-яких персональних даних які ми можемо збирати про Вас під час використання додатку Mr.Spending (нижче, 'додаток').",
    "informationWeCollect": {
      "title": "Information we collect",
      "content": "Information we collect includes both information you knowingly and actively provide us when using app and any information automatically sent by your devices in the course of accessing our app."
    },
    "logData": {
      "title": "Log Data",
      "content": "When you visit our website, our servers may automatically log the standard data provided by your web browser. It may include your device’s Internet Protocol (IP) address, your browser type and version, the pages you visit, the time and date of your visit, the time spent on each page, other details about your visit, and technical details that occur in conjunction with any errors you may encounter. Please be aware that while this information may not be personally identifying by itself, it may be possible to combine it with other data to personally identify individual persons."
    },
    "personalInformation": {
      "title": "Personal information",
      "content": "We may ask for personal information which may include one or more of the following:  Email, Name, Monobank account token in case you want to upload transactions directly from bank api to app"
    },
    "processing": {
      "title": "Legitimate Reasons for Processing Your Personal Information",
      "content": "We only collect and use your personal information when we have a legitimate reason for doing so. In which instance, we only collect personal information that is reasonably necessary to provide our services to you."
    },
    "collectionAndUse": {
      "title": "Collection and Use of Information",
      "content": "We may collect, hold, use, and disclose information for the following purposes, and personal information will not be further processed in a manner that is incompatible with these purposes: to enable you to access and use our app and to upload information about your monobank account transactions directly from bank api to app"
    },
    "security": {
      "title": "Security of your personal information",
      "content": "When we collect and process personal information, and while we retain this information, we will protect it within commercially acceptable means to prevent loss and theft, as well as unauthorized access, disclosure, copying, use, or modification. Although we will do our best to protect the personal information you provide to us, we advise that no method of electronic transmission or storage is 100% secure, and no one can guarantee absolute data security. We will comply with laws applicable to us in respect of any data breach. You are responsible for selecting any password and its overall security strength, ensuring the security of your own information within the bounds of our services."
    },
    "durationOfKeeping": {
      "title": "How Long We Keep Your Personal Information",
      "content": "We keep your personal information only for as long as we need to. This time period may depend on what we are using your information for, in accordance with this privacy policy. If your personal information is no longer required, we will delete it or make it anonymous by removing all details that identify you."
    },
    "disclosure": {
      "title": "Disclosure of Personal Information to Third Parties",
      "content": "We may disclose personal information to: IT service providers, data storage, hosting and server providers, advertisers, or analytics platforms our employees. Third parties we currently use include Firebase for authentication, Vercel for our web hosting, MongoDB for data storage."
    },
    "international": {
      "title": "International Transfers of Personal Information",
      "content": "The personal information we collect is stored and/or processed where we or our partners, affiliates, and third-party providers maintain facilities. Please be aware that the locations to which we store, process, or transfer your personal information may not have the same data protection laws as the country in which you initially provided the information. If we transfer your personal information to third parties in other countries: (i) we will perform those transfers in accordance with the requirements of applicable law; (ii) we will protect the transferred personal information in accordance with this privacy policy."
    },
    "yourRights": {
      "title": "Your Rights and Controlling Your Personal Information",
      "content": "You always retain the right to withhold personal information from us, with the understanding that your experience of our website may be affected. We will not discriminate against you for exercising any of your rights over your personal information. If you do provide us with personal information you understand that we will collect, hold, use and disclose it in accordance with this privacy policy. You retain the right to request details of any personal information we hold about you. If we receive personal information about you from a third party, we will protect it as set out in this privacy policy. If you are a third party providing personal information about somebody else, you represent and warrant that you have such person’s consent to provide the personal information to us. If you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time. Please be aware we may need to request specific information from you to help us confirm your identity. If you believe that any information we hold about you is inaccurate, out of date, incomplete, irrelevant, or misleading, please contact us using the details provided in this privacy policy. We will take reasonable steps to correct any information found to be inaccurate, incomplete, misleading, or out of date. If you believe that we have breached a relevant data protection law and wish to make a complaint, please contact us using the details below and provide us with full details of the alleged breach. We will promptly investigate your complaint and respond to you, in writing, setting out the outcome of our investigation and the steps we will take to deal with your complaint. You also have the right to contact a regulatory body or data protection authority in relation to your complaint."
    },
    "limits": {
      "title": "Limits of Our Policy",
      "content": "Our website may link to external sites that are not operated by us. Please be aware that we have no control over the content and policies of those sites, and cannot accept responsibility or liability for their respective privacy practices."
    },
    "changes": {
      "title": "Changes to This Policy",
      "content": "At our discretion, we may change our privacy policy to reflect updates to our business processes, current acceptable practices, or legislative or regulatory changes. If we decide to change this privacy policy, we will post the changes here at the same link by which you are accessing this privacy policy. If required by law, we will get your permission or give you the opportunity to opt in to or opt out of, as applicable, any new uses of your personal information."
    },
    "contact": {
      "title": "Contact Us",
      "content": "For any questions or concerns regarding your privacy, you may contact us using the following details: Mr.Spending Data Protection Officer kovalovy76@gmail.com"
    }
  }
}
